MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_dac.h
  * @brief   Header file for the DAC HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_DAC_H
#define STM32C5XX_HAL_DAC_H

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_dac.h"

/** @addtogroup DAC
  * @{
  */

#if defined(DAC1)

/* Exported types ------------------------------------------------------------*/

/** @defgroup DAC_Exported_Types HAL DAC Types
  * @{
  */

/** @defgroup DAC_Exported_Types_Group1 Enumerations
  * @{
  */

/**
  * @brief  HAL DAC instance
  */
typedef enum
{
  HAL_DAC1 = DAC1_BASE, /*!< DAC1 */
} hal_dac_t;

/**
  * @brief  HAL DAC channels.
  */
typedef enum
{
  HAL_DAC_CHANNEL_1  = 0U, /*!< DAC channel 1 */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
  HAL_DAC_CHANNEL_2  = 1U  /*!< DAC channel 2 */
#endif /* DAC_NB_OF_CHANNEL */
} hal_dac_channel_t;

/**
  * @brief  HAL DAC state definition
  */
typedef enum
{
  HAL_DAC_STATE_RESET                          = 0U,           /*!< DAC not yet initialized or is de-initialized */
  HAL_DAC_STATE_SEPARATE_CHANNEL_CONFIGURED    = (1U << 31U),  /*!< DAC is initialized
                                                                    and a global configuration has been applied,
                                                                    the channels are used separately */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
  HAL_DAC_STATE_DUAL_CHANNEL_CONFIGURED        = (1U << 30U),  /*!< DAC is configured in dual channel mode */
  HAL_DAC_STATE_DUAL_CHANNEL_ACTIVE            = (1U << 28U)   /*!< DAC is Active in dual channel mode */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */
} hal_dac_state_t;

/**
  * @brief  HAL DAC channel state definition
  */
typedef enum
{
  HAL_DAC_CHANNEL_STATE_RESET         = 0U,          /*!< DAC CHANNEL not yet initialized or disabled  */
  HAL_DAC_CHANNEL_STATE_IDLE          = (1U << 31U), /*!< DAC CHANNEL is initialized and a channel configuration
                                                          has been applied */
  HAL_DAC_CHANNEL_STATE_ACTIVE        = (1U << 30U), /*!< DAC CHANNEL is active, conversion is running */
#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
  HAL_DAC_CHANNEL_STATE_ACTIVE_SILENT = (1U << 29U)  /*!< DAC CHANNEL is active, conversion is running,
                                                          using DMA in silent mode */
#endif /* USE_HAL_DAC_DMA  */
} hal_dac_channel_state_t;

/**
  * @brief  HAL DAC channel trigger
  */
typedef enum
{
  HAL_DAC_TRIGGER_NONE                = 0xFFFFFFFFUL,                       /*!< Conversion is automatic once the DAC_DHRxxxx register*/
  HAL_DAC_TRIGGER_SOFTWARE            = LL_DAC_TRIGGER_SOFTWARE,            /*!< conversion started by software trigger for DAC channel */
  HAL_DAC_TRIGGER_TIM1_TRGO           = LL_DAC_TRIGGER_TIM1_TRGO,           /*!< TIM1 TRGO selected as external conversion trigger for DAC channel. */
  HAL_DAC_TRIGGER_TIM2_TRGO           = LL_DAC_TRIGGER_TIM2_TRGO,           /*!< TIM2 TRGO selected as external conversion trigger for DAC channel. */
  HAL_DAC_TRIGGER_TIM5_TRGO           = LL_DAC_TRIGGER_TIM5_TRGO,           /*!< TIM5 TRGO selected as external conversion trigger for DAC channel. */
  HAL_DAC_TRIGGER_TIM6_TRGO           = LL_DAC_TRIGGER_TIM6_TRGO,           /*!< TIM6 TRGO selected as external conversion trigger for DAC channel. */
  HAL_DAC_TRIGGER_TIM7_TRGO           = LL_DAC_TRIGGER_TIM7_TRGO,           /*!< TIM7 TRGO selected as external conversion trigger for DAC channel. */
  HAL_DAC_TRIGGER_TIM8_TRGO           = LL_DAC_TRIGGER_TIM8_TRGO,           /*!< TIM8 TRGO selected as external conversion trigger for DAC channel. */
  HAL_DAC_TRIGGER_TIM12_TRGO          = LL_DAC_TRIGGER_TIM12_TRGO,          /*!< TIM12 TRGO selected as external conversion trigger for DAC channel. */
  HAL_DAC_TRIGGER_TIM15_TRGO          = LL_DAC_TRIGGER_TIM15_TRGO,          /*!< TIM15 TRGO selected as external conversion trigger for DAC channel. */
#if defined(LPTIM1)
  HAL_DAC_TRIGGER_LPTIM1_OC1          = LL_DAC_TRIGGER_LPTIM1_OC1,          /*!< LPTIM1 CH1 selected as external conversion trigger for DAC channel. */
#endif /* LPTIM1 */
  HAL_DAC_TRIGGER_EXTI9               = LL_DAC_TRIGGER_EXTI9,               /*!< EXTI Line9 event selected as external conversion trigger for DAC channel. */
} hal_dac_trigger_t;

/**
  * @brief DAC channel output buffer mode
  */
typedef enum
{
  HAL_DAC_OUTPUT_BUFFER_ENABLED  = LL_DAC_OUTPUT_BUFFER_ENABLE,  /*!< The output is buffered:
                                                                      higher drive current capability,
                                                                      but also higher current consumption */
  HAL_DAC_OUTPUT_BUFFER_DISABLED = LL_DAC_OUTPUT_BUFFER_DISABLE, /*!< The output is not buffered:
                                                                      lower drive current capability,
                                                                      but also lower current consumption */
} hal_dac_output_buffer_status_t;

/**
  * @brief   DAC channel data alignment
  */
typedef enum
{
  HAL_DAC_DATA_ALIGN_12_BITS_RIGHT = 0x00000000U, /*!< Data must be written in 12-bit right alignment */
  HAL_DAC_DATA_ALIGN_12_BITS_LEFT  = 0x00000001U, /*!< Data must be written in 12-bit left  alignment */
  HAL_DAC_DATA_ALIGN_8_BITS_RIGHT  = 0x00000002U  /*!< Data must be written in  8-bit right alignment */
} hal_dac_data_alignment_t;

/**
  * @brief DAC channel output connection.
  * @note  With some configuration of mode and buffer, there are both internal and external connections.
  *        This applies regardless of this hal_dac_output_connection_t value.
  */
typedef enum
{
  HAL_DAC_OUTPUT_CONNECTION_EXTERNAL = LL_DAC_OUTPUT_CONNECT_EXTERNAL,    /*!< DAC channel output is connected to external
                                        pin.
                                        Note: Depending on other parameters (mode normal or sample and hold,
                                              output buffer state), output can also be connected to on-chip
                                              peripherals, refer to ref manual. */
  HAL_DAC_OUTPUT_CONNECTION_INTERNAL = LL_DAC_OUTPUT_CONNECT_INTERNAL /*!< DAC channel output is connected to on-chip
                                        peripherals (via internal paths).
                                        Note: Depending on other parameters (mode normal or sample and hold,
                                              output buffer state), output can also be connected to external pin,
                                              refer to ref manual. */
} hal_dac_output_connection_t ;

/**
  * @brief DAC channel sample and hold mode
  */
typedef enum
{
  HAL_DAC_SAMPLE_AND_HOLD_DISABLED = LL_DAC_OUTPUT_MODE_NORMAL,         /*!< The output is in normal mode */
  HAL_DAC_SAMPLE_AND_HOLD_ENABLED  = LL_DAC_OUTPUT_MODE_SAMPLE_AND_HOLD /*!< The output is in sample-and-hold mode.
                                                                             Note: the sample-and-hold mode requires
                                                                             an external capacitor */
} hal_dac_sample_and_hold_status_t;

/**
  * @brief  DAC high frequency interface mode
  */
typedef enum
{
  HAL_DAC_HIGH_FREQ_MODE_DISABLED     = LL_DAC_HIGH_FREQ_MODE_DISABLED,    /*!< High frequency interface mode disabled*/
  HAL_DAC_HIGH_FREQ_MODE_ABOVE_80MHZ  = LL_DAC_HIGH_FREQ_MODE_ABOVE_80MHZ, /*!< High frequency interface
                                                                                mode compatible to AHB>80MHz enabled */
  HAL_DAC_HIGH_FREQ_MODE_ABOVE_160MHZ = LL_DAC_HIGH_FREQ_MODE_ABOVE_160MHZ /*!< High frequency interface
                                                                                mode compatible to AHB>160MHz enabled */
} hal_dac_high_freq_mode_t;

/**
  * @brief  DAC channel signed or unsigned data format
  */
typedef enum
{
  HAL_DAC_SIGN_FORMAT_UNSIGNED = LL_DAC_SIGN_FORMAT_UNSIGNED, /*!< The data format is not signed */
  HAL_DAC_SIGN_FORMAT_SIGNED   = LL_DAC_SIGN_FORMAT_SIGNED    /*!< The data format is signed */
} hal_dac_sign_format_t;

/**
  * @brief  DAC channel DMA double data mode
  */
typedef enum
{
  HAL_DAC_DMA_DOUBLE_DATA_MODE_DISABLED = 0U,  /*!< The DMA data mode is the single data mode */
  HAL_DAC_DMA_DOUBLE_DATA_MODE_ENABLED  = 1U   /*!< The DMA data mode is the double data mode */
} hal_dac_dma_double_data_mode_status_t;

/**
  * @brief  HAL DAC channel triangle wave and pseudo noise amplitude
  */

