MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.h
typedef enum
{
  HAL_DAC_WAVE_AMPLITUDE_1    = LL_DAC_TRIANGLE_AMPLITUDE_1,    /*!< Noise/triangle amplitude equal to 1 */
  HAL_DAC_WAVE_AMPLITUDE_3    = LL_DAC_TRIANGLE_AMPLITUDE_3,    /*!< Noise/triangle amplitude equal to 3 */
  HAL_DAC_WAVE_AMPLITUDE_7    = LL_DAC_TRIANGLE_AMPLITUDE_7,    /*!< Noise/triangle amplitude equal to 7 */
  HAL_DAC_WAVE_AMPLITUDE_15   = LL_DAC_TRIANGLE_AMPLITUDE_15,   /*!< Noise/triangle amplitude equal to 15 */
  HAL_DAC_WAVE_AMPLITUDE_31   = LL_DAC_TRIANGLE_AMPLITUDE_31,   /*!< Noise/triangle amplitude equal to 31 */
  HAL_DAC_WAVE_AMPLITUDE_63   = LL_DAC_TRIANGLE_AMPLITUDE_63,   /*!< Noise/triangle amplitude equal to 63 */
  HAL_DAC_WAVE_AMPLITUDE_127  = LL_DAC_TRIANGLE_AMPLITUDE_127,  /*!< Noise/triangle amplitude equal to 127 */
  HAL_DAC_WAVE_AMPLITUDE_255  = LL_DAC_TRIANGLE_AMPLITUDE_255,  /*!< Noise/triangle amplitude equal to 255 */
  HAL_DAC_WAVE_AMPLITUDE_511  = LL_DAC_TRIANGLE_AMPLITUDE_511,  /*!< Noise/triangle amplitude equal to 511 */
  HAL_DAC_WAVE_AMPLITUDE_1023 = LL_DAC_TRIANGLE_AMPLITUDE_1023, /*!< Noise/triangle amplitude equal to 1023 */
  HAL_DAC_WAVE_AMPLITUDE_2047 = LL_DAC_TRIANGLE_AMPLITUDE_2047, /*!< Noise/triangle amplitude equal to 2047  */
  HAL_DAC_WAVE_AMPLITUDE_4095 = LL_DAC_TRIANGLE_AMPLITUDE_4095, /*!< Noise/triangle amplitude equal to 4095  */
} hal_dac_wave_amplitude_t;


/**
  * @}
  */
/* Exported Constants --------------------------------------------------------*/
/** @defgroup DAC_Exported_Constants HAL DAC Constants
  * @{
  */
/**
  * @brief  HAL DAC error code,
  *         declared and used has bit fields in HAL_DAC_GetLastErrorCodes()
  */
#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
#define HAL_DAC_ERROR_NONE              (0UL)      /*!< No error */
#define HAL_DAC_ERROR_DMA_UNDERRUN_CH1  (1UL << 0U) /*!< DMA underrun error on channel 1 */
#define HAL_DAC_ERROR_DMA_CH1           (1UL << 1U) /*!< DMA transfer error on channel 1 */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#define HAL_DAC_ERROR_DMA_UNDERRUN_CH2  (HAL_DAC_ERROR_DMA_UNDERRUN_CH1 << 8U) /*!< DMA underrun error on channel 2 */
#define HAL_DAC_ERROR_DMA_CH2           (HAL_DAC_ERROR_DMA_CH1 << 8U)          /*!< DMA transfer error on channel 2 */
#endif /* DAC_NB_OF_CHANNEL */

#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/**
  * @brief  HAL DAC optional interrupts
  */
#define HAL_DAC_OPT_DMA_IT_NONE     HAL_DMA_OPT_IT_NONE     /*!< All optional interrupts are disabled */
#define HAL_DAC_OPT_DMA_IT_HT       HAL_DMA_OPT_IT_HT       /*!< Enable optional IT half completed transfer */
#define HAL_DAC_OPT_DMA_IT_DEFAULT  HAL_DMA_OPT_IT_DEFAULT  /*!< Enable all optional IT */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define HAL_DAC_OPT_DMA_IT_SILENT   HAL_DMA_OPT_IT_SILENT   /*!< DMA in silent mode */
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /*  USE_HAL_DAC_DMA */

/**
  * @}
  */

/** @defgroup DAC_Exported_Types_Group2 Handle Structure
  * @{
  */
/**
  * @brief DAC Handle structure Definition
  *
  */
/*!< DAC handle structure definition */
typedef struct hal_dac_handle_s hal_dac_handle_t; /*!< DAC handle type definition */
/**
  * @}
  */

/** @defgroup DAC_Exported_Types_Group_Callback callback prototype
  * @{
  */
/* DAC callback prototype and error callback prototype */
typedef void (* hal_dac_cb_t)(hal_dac_handle_t *hdac, hal_dac_channel_t channel); /*!< Callback prototype
                                                                                       for converter completed */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
typedef void (* hal_dac_dual_channel_cb_t)(hal_dac_handle_t *hdac); /*!< Callback prototype
                                                                         for dual channel converter completed */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */
typedef void (* hal_dac_error_cb_t)(hal_dac_handle_t *hdac);        /*!< Callback prototype for error callback */
/**
  * @}
  */

/** @addtogroup DAC_Exported_Types_Group2 Handle Structure
  * @{
  */

/**
  * @brief  DAC handle structure definition,
  *         contains: DAC instance, states, callbacks, DMA handles linked with DAC channels.
  */
struct hal_dac_handle_s
{
  hal_dac_t                         instance;      /*!< Peripheral instance */
  volatile hal_dac_state_t          global_state;  /*!< DAC global state */
  volatile hal_dac_channel_state_t  channel_state[DAC_NB_OF_CHANNEL]; /*!< State for channels subinstances,
                                                                           they can be active in parallel */
  volatile uint32_t                *channel_dhr_address[DAC_NB_OF_CHANNEL]; /*!< DHR (data holding register) address
                                                                                 according to the alignment */

#if defined(USE_HAL_DAC_GET_LAST_ERRORS) && (USE_HAL_DAC_GET_LAST_ERRORS == 1)
  volatile uint16_t                 last_error_codes[DAC_NB_OF_CHANNEL]; /*!< DAC channel errors codes
                                                    array of uint16_t to avoid race condition between the channels */
#endif /* USE_HAL_DAC_GET_LAST_ERRORS */

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
  hal_dma_handle_t                 *dma_ch[DAC_NB_OF_CHANNEL];   /*!< Pointer to a DMA handle
                                                                      (used by DAC channels or by dual channels) */
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
  hal_dac_channel_t                 dual_channel_dma_requester;  /*!< Dual mode DMA channel requester */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* USE_HAL_DAC_DMA  */

#if defined (USE_HAL_DAC_REGISTER_CALLBACKS) && (USE_HAL_DAC_REGISTER_CALLBACKS == 1)
  hal_dac_cb_t                 p_conv_cplt_cb;      /*!< Converter completed callback */
  hal_dac_cb_t                 p_conv_half_cplt_cb; /*!< Converter half completed callback */
  hal_dac_cb_t                 p_stop_cplt_cb;      /*!< Stop completed callback */
#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
  hal_dac_dual_channel_cb_t    p_dual_channel_conv_cplt_cb;      /*!< Dual channel converter completed callback */
  hal_dac_dual_channel_cb_t    p_dual_channel_conv_half_cplt_cb; /*!< Dual channel converter half completed callback */
  hal_dac_dual_channel_cb_t    p_dual_channel_stop_cplt_cb;      /*!< Dual channel stop completed callback */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */
  hal_dac_error_cb_t           p_error_cb;          /*!< Converter error callback */
#endif /* USE_HAL_DAC_REGISTER_CALLBACKS */

