MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dac.h
#if defined(USE_HAL_DAC_USER_DATA) && (USE_HAL_DAC_USER_DATA == 1)
  const void                  *p_user_data; /*!< User Data Pointer */
#endif /* USE_HAL_DAC_USER_DATA */
};

/**
  * @}
  */

/** @defgroup DAC_Exported_Types_Group4 Configuration Structure
  * @{
  */

/**
  * @brief   DAC configuration "sample and hold" structure definition
  */
typedef struct
{
  uint32_t sample_time_cycle;/*!< The sample time for the channel, unit is in number of clock period.
                                  This parameter must be a number the range [0, 1023].
                                  The sample_time_cycle is applied when the sample_and_hold mode is
                                  HAL_DAC_SAMPLE_AND_HOLD_ENABLED */

  uint32_t hold_time_cycle;  /*!< The hold time for the channel, unit is in number of clock period.
                                  This parameter must be a number the range [0, 1023].
                                  The hold_time is applied when the sample_and_hold mode is
                                  HAL_DAC_SAMPLE_AND_HOLD_ENABLED */

  uint32_t refresh_time_cycle; /*!< The refresh time for the channel, unit is in number of clock period.
                                    This parameter must be a number the range [0, 255].
                                    The refresh_time is applied when the sample_and_hold mode is
                                    HAL_DAC_SAMPLE_AND_HOLD_ENABLED */
} hal_dac_channel_sample_and_hold_config_t;

/**
  * @brief   DAC configuration structure definition
  */
typedef struct
{
  hal_dac_high_freq_mode_t high_frequency_mode;  /*!< The frequency interface mode
                                                      Note: HAL_DAC_GetOptimumFrequencyMode() API allows
                                                      to select and update the high frequency mode afterwards */
} hal_dac_config_t;

/**
  * @brief   DAC channel configuration structure definition
  */
typedef struct
{
  hal_dac_sign_format_t           data_sign_format;  /*!< The data format: signed data or unsigned data */
  hal_dac_trigger_t               trigger;           /*!< The external trigger for the channel */
  hal_dac_output_buffer_status_t  output_buffer;     /*!< The DAC channel output buffer: enabled or disabled */
  hal_dac_output_connection_t     output_connection; /*!< The DAC channel output connection:
                                                          to external pin or to on chip peripheral */
  hal_dac_data_alignment_t        alignment;         /*!< Default alignment and width, for both channel:
                                                          12bit right or left align, 8bit right align */
} hal_dac_channel_config_t;

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/**
  * @brief   DAC dual channel configuration structure definition
  */
typedef struct
{
  struct
  {
    hal_dac_sign_format_t           data_sign_format;  /*!< The data format: signed data or unsigned data */
    hal_dac_trigger_t               trigger;           /*!< The external trigger for the channel */
    hal_dac_output_buffer_status_t  output_buffer;     /*!< The DAC channel output buffer: enabled or disabled */
    hal_dac_output_connection_t     output_connection; /*!< The DAC channel output connection:
                                                          to external pin or to on chip peripheral */
  } channel1_config; /*!< Dual channel, sub config for channel 1, see fields description above */

  struct
  {
    hal_dac_sign_format_t           data_sign_format;  /*!< The data format: signed data or unsigned data */
    hal_dac_trigger_t               trigger;           /*!< The external trigger for the channel */
    hal_dac_output_buffer_status_t  output_buffer;     /*!< The DAC channel output buffer: enabled or disabled */
    hal_dac_output_connection_t     output_connection; /*!< The DAC channel output connection:
                                                          to external pin or to on chip peripheral */
  } channel2_config; /*!< Dual channel, sub config for channel 2, see fields description above */

  hal_dac_data_alignment_t          alignment;        /*!< Alignment and width, for dual channel:
                                                           12bit right or left align, 8bit right align */
} hal_dac_dual_channel_config_t;
#endif /* USE_HAL_DAC_DUAL_CHANNEL */
#endif /* DAC_NB_OF_CHANNEL */

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup DAC_Exported_Functions
  * @{
  */

/** @addtogroup DAC_Exported_Functions_Group1_1
  * @{
  */
/* Initialization and de-initialization functions *****************************/
hal_status_t HAL_DAC_Init(hal_dac_handle_t *hdac, hal_dac_t instance);
void         HAL_DAC_DeInit(hal_dac_handle_t *hdac);
/* Peripheral configuration */
hal_dac_high_freq_mode_t HAL_DAC_GetOptimumFrequencyMode(const hal_dac_handle_t *hdac);
hal_status_t HAL_DAC_SetConfig(hal_dac_handle_t *hdac, const hal_dac_config_t *p_config);
void         HAL_DAC_GetConfig(const hal_dac_handle_t *hdac, hal_dac_config_t *p_config);
void         HAL_DAC_ResetConfig(hal_dac_handle_t *hdac);
/* Calibration functions */
hal_status_t HAL_DAC_CalibrateChannelBuffer(hal_dac_handle_t *hdac, hal_dac_channel_t channel);
hal_status_t HAL_DAC_SetChannelBufferCalibrationValue(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                                      uint32_t value);
uint32_t     HAL_DAC_GetChannelBufferCalibrationValue(const hal_dac_handle_t *hdac, hal_dac_channel_t channel);

/**
  * @}
  */

/** @addtogroup DAC_Exported_Functions_Group1_2
  * @{
  */
/* Peripheral channel configuration */
hal_status_t HAL_DAC_SetConfigChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                      const hal_dac_channel_config_t *p_config);

void         HAL_DAC_GetConfigChannel(const hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                      hal_dac_channel_config_t *p_config);

hal_status_t HAL_DAC_SetChannelAlignment(hal_dac_handle_t *hdac, hal_dac_channel_t channel,
                                         hal_dac_data_alignment_t        alignment);

hal_dac_data_alignment_t HAL_DAC_GetChannelAlignment(const hal_dac_handle_t *hdac, hal_dac_channel_t channel);

/**
  * @}
  */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
/** @addtogroup DAC_Exported_Functions_Group1_3
  * @{
  */
hal_status_t HAL_DAC_SetConfigDualChannel(hal_dac_handle_t *hdac, const hal_dac_dual_channel_config_t *p_config);
void         HAL_DAC_GetConfigDualChannel(const hal_dac_handle_t *hdac, hal_dac_dual_channel_config_t *p_config);
hal_status_t HAL_DAC_SetDualChannelAlignment(hal_dac_handle_t *hdac,  hal_dac_data_alignment_t alignment);
hal_dac_data_alignment_t HAL_DAC_GetDualChannelAlignment(const hal_dac_handle_t *hdac);
/**
  * @}
  */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

#endif /* DAC_NB_OF_CHANNEL */
/* Input and output operation functions *****************************************************/
/** @addtogroup DAC_Exported_Functions_Group2_1
  * @{
  */

hal_status_t HAL_DAC_TrigSWConversionChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel);

hal_status_t HAL_DAC_StartChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel);

hal_status_t HAL_DAC_StopChannel(hal_dac_handle_t *hdac, hal_dac_channel_t channel);

hal_status_t HAL_DAC_SetChannelData(hal_dac_handle_t *hdac, hal_dac_channel_t channel, uint32_t data);

uint32_t     HAL_DAC_GetChannelData(const hal_dac_handle_t *hdac, hal_dac_channel_t channel);

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/* DMA separate channel functions to link DAC channel with DMA */
hal_status_t HAL_DAC_SetChannelDMA(hal_dac_handle_t *hdac, hal_dma_handle_t *hdma, hal_dac_channel_t channel);

hal_status_t HAL_DAC_StartChannel_DMA(hal_dac_handle_t *hdac, hal_dac_channel_t channel, const void *p_data,
                                      uint32_t size_byte);

hal_status_t HAL_DAC_StartChannel_DMA_Opt(hal_dac_handle_t *hdac, hal_dac_channel_t channel, const void *p_data,
                                          uint32_t size_byte, uint32_t dac_opt_interrupt);

hal_status_t HAL_DAC_StopChannel_DMA(hal_dac_handle_t *hdac, hal_dac_channel_t channel);
#endif /* USE_HAL_DAC_DMA */

/**
  * @}
  */

#if defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
/** @addtogroup DAC_Exported_Functions_Group2_2
  * @{
  */

#if defined(USE_HAL_DAC_DUAL_CHANNEL) && (USE_HAL_DAC_DUAL_CHANNEL == 1)
hal_status_t HAL_DAC_TrigSWConversionDualChannel(hal_dac_handle_t *hdac);
hal_status_t HAL_DAC_StartDualChannel(hal_dac_handle_t *hdac);
hal_status_t HAL_DAC_StopDualChannel(hal_dac_handle_t *hdac);

hal_status_t HAL_DAC_SetDualChannelData(hal_dac_handle_t *hdac, uint32_t data);
uint32_t     HAL_DAC_GetDualChannelData(const hal_dac_handle_t *hdac);

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/* DMA dual channel functions to link DAC channel with DMA */
hal_status_t HAL_DAC_SetDualChannelDMA(hal_dac_handle_t *hdac, hal_dma_handle_t *hdma,
                                       hal_dac_channel_t dma_requester_channel);

hal_status_t HAL_DAC_StartDualChannel_DMA(hal_dac_handle_t *hdac, const void *p_data, uint32_t size_byte);
hal_status_t HAL_DAC_StartDualChannel_DMA_Opt(hal_dac_handle_t *hdac, const void *p_data, uint32_t size_byte,
                                              uint32_t dac_opt_interrupt);

hal_status_t HAL_DAC_StopDualChannel_DMA(hal_dac_handle_t *hdac);
#endif /* USE_HAL_DAC_DMA */
#endif /* USE_HAL_DAC_DUAL_CHANNEL */

/**
  * @}
  */
#endif /* DAC_NB_OF_CHANNEL */

/** @addtogroup DAC_Exported_Functions_Group3
  * @{
  */

/* Peripheral control functions */

#if defined(USE_HAL_DAC_DMA) && (USE_HAL_DAC_DMA == 1)
/* DMA double data mode functions  */
hal_status_t HAL_DAC_EnableChannelDMADoubleDataMode(hal_dac_handle_t *hdac, hal_dac_channel_t channel);

hal_status_t HAL_DAC_DisableChannelDMADoubleDataMode(hal_dac_handle_t *hdac, hal_dac_channel_t channel);

